{
  "paperId": "5acc452e9191ef3e976f7dc2be4a63f20198f24f",
  "externalIds": {
    "DBLP": "journals/vi/ZhengLC24",
    "DOI": "10.1016/j.visinf.2024.05.001",
    "CorpusId": 269825733
  },
  "publicationVenue": {
    "id": "59345fce-7529-41a4-a0a3-e0458d6930be",
    "name": "Visual Informatics",
    "type": "journal",
    "alternate_names": [
      "Vis Informatics"
    ],
    "issn": "2468-502X",
    "url": "https://www.journals.elsevier.com/visual-informatics/",
    "alternate_urls": [
      "https://www.journals.elsevier.com/visual-informatics",
      "http://www.sciencedirect.com/science/journal/aip/2468502X"
    ]
  },
  "url": "https://www.semanticscholar.org/paper/5acc452e9191ef3e976f7dc2be4a63f20198f24f",
  "title": "Current state of the art and future directions: Augmented reality data visualization to support decision-making",
  "abstract": "Augmented Reality (AR), as a novel data visualization tool, is advantageous in revealing spatial data patterns and data-context associations. Accordingly, recent research has identified AR data visualization as a promising approach to increasing decision-making efficiency and effectiveness. As a result, AR has been applied in various decision support systems to enhance knowledge conveying and comprehension, in which the different data-reality associations have been constructed to aid decision-making.\nHowever, how these AR visualization strategies can enhance different decision support datasets has not been reviewed thoroughly. Especially given the rise of big data in the modern world, this support is critical to decision-making in the coming years. Using AR to embed the decision support data and explanation data into the end user’s physical surroundings and focal contexts avoids isolating the human decision-maker from the relevant data. Integrating the decision-maker’s contexts and the DSS support in AR is a difficult challenge. This paper outlines the current state of the art through a literature review in allowing AR data visualization to support decision-making.\nTo facilitate the publication classification and analysis, the paper proposes one taxonomy to classify different AR data visualization based on the semantic associations between the AR data and physical context. Based on this taxonomy and a decision support system taxonomy, 37 publications have been classified and analyzed from multiple aspects. One of the contributions of this literature review is a resulting AR visualization taxonomy that can be applied to decision support systems. Along with this novel tool, the paper discusses the current state of the art in this field and indicates possible future challenges and directions that AR data visualization will bring to support decision-making.",
  "venue": "Visual Informatics",
  "year": 2024,
  "referenceCount": 85,
  "openAccessPdf": null,
  "fieldsOfStudy": [
    "Computer Science"
  ],
  "s2FieldsOfStudy": [
    {
      "category": "Computer Science",
      "source": "external"
    },
    {
      "category": "Computer Science",
      "source": "s2-fos-model"
    }
  ],
  "publicationTypes": [
    "JournalArticle"
  ],
  "publicationDate": "2024-05-01",
  "journal": {
    "name": "Vis. Informatics",
    "pages": "80-105",
    "volume": "8"
  },
  "citationStyles": {
    "bibtex": "@Article{Zheng2024CurrentSO,\n author = {Mengya Zheng and David Lillis and Abraham G. Campbell},\n booktitle = {Visual Informatics},\n journal = {Vis. Informatics},\n pages = {80-105},\n title = {Current state of the art and future directions: Augmented reality data visualization to support decision-making},\n volume = {8},\n year = {2024}\n}\n"
  },
  "authors": [
    {
      "authorId": "144694628",
      "name": "Mengya Zheng"
    },
    {
      "authorId": "2280384326",
      "name": "David Lillis"
    },
    {
      "authorId": "2301732741",
      "name": "Abraham G. Campbell"
    }
  ],
  "references": [
    {
      "paperId": "4e7b0c6a3d55ae08a9657ecb4c780a6fd292fdc9",
      "title": "STARE: Semantic Augmented Reality Decision Support in Smart Environments"
    },
    {
      "paperId": "2415c2b78655d31294cab202bbe54682e8fc409c",
      "title": "Augmented Reality In-Field Observation Creation and Visualization in Underperforming Areas"
    },
    {
      "paperId": "b79cab712b46704a2d89ec3552e291bb06444c71",
      "title": "Urban computing cyberinfrastructure: visualizing human sentiment using social media and augmented reality"
    },
    {
      "paperId": "63109805396bf2916452894953e5a47ef49e96ac",
      "title": "Augmented reality situated visualization in decision-making"
    },
    {
      "paperId": "966e8b17e582a62e4e760479dafbaeadd68922d3",
      "title": "Augmented reality based - decision making (AR-DM) to support multi-criteria analysis in constructions"
    },
    {
      "paperId": "8b9064423dc5f4357ef5dd7863cb02595e6016cc",
      "title": "Augmented situated visualization methods towards electromagnetic compatibility testing"
    },
    {
      "paperId": "f334cb61524e10e34121f1cafbb8205c6892b7be",
      "title": "Touching the Untouchable: Exploring Multi-Sensory Augmented Reality in the Context of Online Retailing"
    },
    {
      "paperId": "0d3a11312a5bed1a89c2ebe10a3c1ad2d77a8127",
      "title": "Location-Based Augmented Reality In-situ Visualization Applied for Agricultural Fieldwork Navigation"
    },
    {
      "paperId": "3ed15c6cd2e1cc693c9bfef9535be9e697a2d5bf",
      "title": "An augmented reality microscope with real-time artificial intelligence integration for cancer diagnosis"
    },
    {
      "paperId": "39f882052dc4901cc7f7caa80d314a600bde7dd6",
      "title": "Situated Visualization in The Decision Process Through Augmented Reality"
    },
    {
      "paperId": "92e5992882b1faf0b99c2f1ba4585a3eef71b511",
      "title": "Let Me Imagine That for You: Transforming the Retail Frontline Through Augmenting Customer Mental Imagery Ability"
    },
    {
      "paperId": "f7f202e84879f657e0cf0a705637f34cf87cfb1c",
      "title": "Augmented Reality in the Integrative Internet of Things (AR-IoT): Application for Precision Farming"
    },
    {
      "paperId": "4fdfc1958c4744e11731c518e8b188c2fe7f024b",
      "title": "Designing Augmented Reality Applications for Personal Health Decision-Making"
    },
    {
      "paperId": "9271989485ff94d21e36f1525398a17bcd9c0751",
      "title": "Relational localization based Augmented reality Interface for IOT applications"
    },
    {
      "paperId": "d8f67bb3193c1c42ce01ccc543ba17eda20fc8f4",
      "title": "Augmented Reality-based approach for interpretation and visualization of methane flow behaviour"
    },
    {
      "paperId": "0a831a904cef7977add956ce2b624639c22f5fd9",
      "title": "Information overload in the information age: a review of the literature from business administration, business psychology, and related disciplines with a bibliometric approach and framework development"
    },
    {
      "paperId": "d63afbebd022edadbb1e25458dd9cf19b4b5cb29",
      "title": "Three-dimensional Printing and Augmented Reality: Enhanced Precision for Robotic Assisted Partial Nephrectomy."
    },
    {
      "paperId": "fa6b1b9f8228937c30e532f8a3ec5bd637fe19ad",
      "title": "A systematic review and taxonomy of explanations in decision support and recommender systems"
    },
    {
      "paperId": "7a388962574aca44354c49e160ae62a7096e7a94",
      "title": "A Design Space for Virtuality-Introduced Internet of Things"
    },
    {
      "paperId": "4f0b4fadb909ec0392898bf919cf96beb308901d",
      "title": "Augmented and virtual reality based monitoring and safety system: A prototype IoT platform"
    },
    {
      "paperId": "c3e18026b85512b636535a78a6e9314feb1d9d32",
      "title": "Spatial Analytic Interfaces: Spatial User Interfaces for In Situ Visual Analytics"
    },
    {
      "paperId": "a06307cd602c9c0aa6c5b090c02dc9f126e2a0af",
      "title": "Evaluate Learner's Acceptance of Augmented Reality Based Military Decision Making Process Training System"
    },
    {
      "paperId": "633b36a5f7fc4dd3c105736b4c415593bd2f9308",
      "title": "Riverwalk: Incorporating Historical Photographs in Public Outdoor Augmented Reality Experiences"
    },
    {
      "paperId": "4d35f7feb328f7c1a6fc7a4d45878c6e1a3904e7",
      "title": "ARIoT: scalable augmented reality framework for interacting with Internet of Things appliances everywhere"
    },
    {
      "paperId": "c819d3011bbf46c7ab9263e66f1fa4e1cf1eb46e",
      "title": "A decision support system for managing irrigation in agriculture"
    },
    {
      "paperId": "f04bc3fd9fa6ece241df64f769189565808afba6",
      "title": "Defining Rules Among Devices in Smart Environment Using an Augmented Reality Headset"
    },
    {
      "paperId": "dbfea34a4d2239f7595841f1162e0f37ed8bac97",
      "title": "Visualizing Big Data with augmented and virtual reality: challenges and research agenda"
    },
    {
      "paperId": "5efb980d3b7f4750d714ae1c1448e1f6c48a811f",
      "title": "MANGO - Mobile Augmented Reality with Functional Eating Guidance and Food Awareness"
    },
    {
      "paperId": "c56d546fbb5a5a0722118a9bba4badfd71ca6240",
      "title": "A location-based Augmented Reality system for the spatial interaction with historical datasets"
    },
    {
      "paperId": "fb005384c8fb9bd80dc05a1758ca15823dda16c4",
      "title": "Situated Analytics"
    },
    {
      "paperId": "afbb25c4346f9a9b75ba5cb751d47845a4a5b584",
      "title": "Computational rationality: A converging paradigm for intelligence in brains, minds, and machines"
    },
    {
      "paperId": "662652a0fb0278bb7c8ff0122e2228d8ddc04ce9",
      "title": "Tangible Mixed Reality On-Site: Interactive Augmented Visualisations from Architectural Working Models in Urban Design"
    },
    {
      "paperId": "dc57c5d06e00eaced9c3c9bdb93c37ff0a071a45",
      "title": "Allocation of visual attention while driving with simulated augmented reality"
    },
    {
      "paperId": "39511aef4a4dc6106ae76b98607441e71d9630a1",
      "title": "Augmented Reality Web Applications with Mobile Agents in the Internet of Things"
    },
    {
      "paperId": "96078130d4444d033212b1abb3d567df99c081ba",
      "title": "Indoor localization and navigation using smartphones augmented reality and inertial tracking"
    },
    {
      "paperId": "021a308bc8ffa1bce51f07b233b95a32f96d947b",
      "title": "A conceptual framework for integrating building information modeling with augmented reality"
    },
    {
      "paperId": "f44f70c467b87c63f4f70745e2c192fa1c9feefe",
      "title": "InfoSPOT: A mobile Augmented Reality method for accessing building information through a situation awareness approach"
    },
    {
      "paperId": "8fdd69441aa9a7eb79626d31c9c7c2cfe8a48f32",
      "title": "Integrating a mobile augmented reality activity to contextualize student learning of a socioscientific issue"
    },
    {
      "paperId": "e1917facfee804bdcbbf1068c95ec32f27388bbb",
      "title": "Mobile augmented reality applications for library services"
    },
    {
      "paperId": "5b3e6ef30fec4be7e730adae463a2ad6a5b1a11d",
      "title": "Vison-based auxiliary navigation method using augmented reality for unmanned aerial vehicles"
    },
    {
      "paperId": "157d408ed744ef4176b4dd57bbacccc3a32bdfdb",
      "title": "Augmented Reality in the Classroom"
    },
    {
      "paperId": "a862c379159b0c62c6b394efc9043513337e1394",
      "title": "Making Vehicles Transparent Through V2V Video Streaming"
    },
    {
      "paperId": "e56e56232e9f32dd96c40fa0fa0888e9e42fca22",
      "title": "A new typology of augmented reality applications"
    },
    {
      "paperId": "7bce6a63f376aa2afa14930163e2249013b62458",
      "title": "A brief review on Decision Support Systems and it's applications"
    },
    {
      "paperId": "c6dcca2273a77e694f8bdad205979cd49ffb4cba",
      "title": "New Augmented Reality Taxonomy: Technologies and Features of Augmented Environment"
    },
    {
      "paperId": "14c08013b8d7109c06900cf5b5d85686ef5a6f9d",
      "title": "Square AR: Using Augmented Reality for Urban Planning"
    },
    {
      "paperId": "9744b5dc71adb4bf4c5a37d2b0bea31c17e6c944",
      "title": "Virtual Interactive Presence and Augmented Reality (VIPAR) for Remote Surgical Assistance"
    },
    {
      "paperId": "5d6382267bf382b1b48b08f30db325e5d128cbd2",
      "title": "Visualising Environmental Corrosion in Outdoor Augmented Reality"
    },
    {
      "paperId": "38263d49ae4dd0e7fa182024b2086ef0a5641c54",
      "title": "Technical Section: Annotation in outdoor augmented reality"
    },
    {
      "paperId": "81310e4e0bab79ef147a9fc5ccab476e06e95c77",
      "title": "Evaluating the post-stroke patients progress using an Augmented Reality Rehabilitation system"
    },
    {
      "paperId": "44c9f67c40a6abfdb80b5cdda6de8fe7c939dd4a",
      "title": "SiteLens: situated visualization techniques for urban site visits"
    },
    {
      "paperId": "4b163e3345dd07a1bed3a80451391edd67ec84af",
      "title": "Methodology for the use of DSSAT models for precision agriculture decision support"
    },
    {
      "paperId": "499c77f3707c5b8fbef096c6b6fa0fa70ed6565c",
      "title": "Visualization and interaction of pervasive services using context-aware augmented reality"
    },
    {
      "paperId": "3600890a1e810e1cd7a3d215825944ff05d25539",
      "title": "Virtual redlining for civil engineering in real environments"
    },
    {
      "paperId": "d829ea2491a21d7a2c93ef6863c489fee5968219",
      "title": "Contextual Anatomic Mimesis Hybrid In-Situ Visualization Method for Improving Multi-Sensory Depth Perception in Medical Augmented Reality"
    },
    {
      "paperId": "6db8081d3120f1fa7272988db3f3512d35b51e81",
      "title": "A classification scheme for multi-sensory augmented reality"
    },
    {
      "paperId": "c2e6b1c5aab9fd5cb41e7939aef829010466b791",
      "title": "Augmented Reality for Rehabilitation of Cognitive Disabled Children: A Preliminary Study"
    },
    {
      "paperId": "1ebf317cef45d58971b28e84f1920a9fa0040595",
      "title": "Model-driven decision support systems: Concepts and research directions"
    },
    {
      "paperId": "959a9b31e1c08f14fffe24fe426caf514563c0ea",
      "title": "A mobile markerless AR system for maintenance and repair"
    },
    {
      "paperId": "0900e953f2b549e9660145a3266fc31e93fba0a4",
      "title": "Multidimensional information visualization using augmented reality"
    },
    {
      "paperId": "ab8bc000c544d83ee32e464c7259c05bba86ba62",
      "title": "A critical analysis of decision support systems research"
    },
    {
      "paperId": "52d9edc17bd3c7a071a49315be25d6442fd73b25",
      "title": "UMAR: Ubiquitous Mobile Augmented Reality"
    },
    {
      "paperId": "ac885fbe10bf39c15bc0493364ccca52fab4d872",
      "title": "Taxonomy for visualizing location-based information"
    },
    {
      "paperId": "95f31687c79e5cdda5092cc3d4cec72c20f5fa2d",
      "title": "Developing a decision support system for integrated production in agriculture"
    },
    {
      "paperId": "9a7ef2cd1aaed254f901ecb94f6738481b749b58",
      "title": "Augmented reality: which augmentation for which reality?"
    },
    {
      "paperId": "dcb9a4be9913977c3b7c17d539b5aee4e14ea6ae",
      "title": "A wearable spatial conferencing space"
    },
    {
      "paperId": "f24732bb00a6f38dc36f7baa838b2d9a1889040e",
      "title": "Augmented reality: linking real and virtual worlds: a new paradigm for interacting with computers"
    },
    {
      "paperId": "d536fa22e011402b0a1b85c7a03cd5de38083f00",
      "title": "Shared space: An augmented reality approach for computer supported collaborative work"
    },
    {
      "paperId": "96ac874ea8938ad6aa4911774dc93ba4a5c845b0",
      "title": "Augmented reality: a class of displays on the reality-virtuality continuum"
    },
    {
      "paperId": "77ae5d1cec22ad6316de4fc2510a25d2085956f6",
      "title": "An empirical investigation into decision support systems capabilities: A proposed taxonomy"
    },
    {
      "paperId": "f6f7162203a84eb7a55db85d56e6af2ed14b1bff",
      "title": "Time Stress and the Processing of Visual Displays"
    },
    {
      "paperId": "7f40b102d14d8886f985c0e3ff242ff9933ac467",
      "title": "Knowing Your Student: Targeted Teaching Decision Support Through Asymmetric Mixed Reality Collaborative Learning"
    },
    {
      "paperId": "52b455b2485b1e3282946f518c01529cde83498c",
      "title": "A Decision Support System Based on Augmented Reality for the Safe Preparation of Chemotherapy Drugs"
    },
    {
      "paperId": "e72612afc5fd00fc140ce53e795c173ec217b369",
      "title": "Decision Support."
    },
    {
      "paperId": "e16b4067eed3d2bd7c28518ded0177593eafc425",
      "title": "Embedded Data Representations"
    },
    {
      "paperId": "84ea7030a2d23426ef8cd7995c63dcb6f8408b2a",
      "title": "Housing Health and Safety Decision Support System with Augmented Reality"
    },
    {
      "paperId": "aa04bd4e03a6e80427c05f8bf942d3b4586e40bc",
      "title": "Augmented Reality as a Tool for Production and Quality Monitoring"
    },
    {
      "paperId": "a77e78e46a0cdfdc191e732e23da3deac57fd366",
      "title": "Augmented Reality : Applications , Challenges and Future Trends"
    },
    {
      "paperId": "cbbe52958f8c40dfa93125aadfe077c4f671d6a0",
      "title": "Augmented Reality Learning Experiences: Survey of Prototype Design and Evaluation"
    },
    {
      "paperId": "5d4d48a5398dc79f761b318b57f573ef907a5bd9",
      "title": "User evaluation of mobile augmented reality in architectural planning"
    },
    {
      "paperId": "35aff4e68188af91344736994eb7dcac1bcc0188",
      "title": "Information Visualization for Decision Support"
    },
    {
      "paperId": "187e3a8b2d94c39e264a7a19f33094ace1a758de",
      "title": "Personalized In-store E-Commerce with the PromoPad: an Augmented Reality Shopping Assistant"
    },
    {
      "paperId": "ae483721c86e0f598368f4f1856d818baf4d90f6",
      "title": "Review: Medical Diagnostic Decision Support Systems - Past, Present, And Future: A Threaded Bibliography and Brief Commentary"
    },
    {
      "paperId": "0a0a2a3c14bb39ba3fc03625ca7fd30a644457ae",
      "title": "D 4 AR – A 4-DIMENSIONAL AUGMENTED REALITY MODEL FOR AUTOMATING CONSTRUCTION PROGRESS MONITORING DATA COLLECTION , PROCESSING AND COMMUNICATION"
    },
    {
      "paperId": "f10626bb69049461a0298a0f761b29265fe66c34",
      "title": "TARCAST: Taxonomy for Augmented Reality CASTing with Web Support"
    }
  ]
}