{
  "paperId": "80c1ff1b3f3767896ec8883a2f1f8293def8cf7b",
  "externalIds": {
    "DBLP": "conf/ieeevast/MayHKSC10",
    "MAG": "2071949039",
    "DOI": "10.1109/VAST.2010.5649078",
    "CorpusId": 7161769
  },
  "publicationVenue": null,
  "url": "https://www.semanticscholar.org/paper/80c1ff1b3f3767896ec8883a2f1f8293def8cf7b",
  "title": "The state of visual analytics: Views on what visual analytics is and where it is going",
  "abstract": "In the 2005 publication “Illuminating the Path” visual analytics was defined as “the science of analytical reasoning facilitated by interactive visual interfaces.” A lot of work has been done in visual analytics over the intervening five years. While visual analytics started in the United States with a focus on security, it is now a worldwide research agenda with a broad range of application domains. This is evidenced by efforts like the European VisMaster program and the upcoming Visual Analytics and Knowledge Discovery (VAKD) workshop, just to name two. There are still questions concerning where and how visual analytics fits in the large body of research and applications represented by the VisWeek community. This panel will present distinct viewpoints on what visual analytics is and its role in understanding complex information in a complex world. The goal of this panel is to engender discussion from the audience on the emergence and continued advancement of visual analytics and its role relative to fields of related research. Four distinguished panelists will provide their perspective on visual analytics focusing on what it is, what it should be, and thoughts about a development path between these two states. The purpose of the presentations is not to give a critical review of the literature but rather to give a review on the field and to provide a contextual perspective based on the panelists' years of experience and accumulated knowledge. Each panelist will have at most 15 minutes to present their position in order to establish the context for the audience. The rest of the time will be open for questions. The panel organizer will oversee the panel and ensure there are numerous questions of the panelists. On August 6, 2010 this world lost Jim Thomas. His influence and impact on our community were clear and profound with conferences, funding programs, research groups, consortia, government agencies, and industry. Through his intellect, energy, and passion Jim was able to create an international movement and shape a new discipline — visual analytics. This discussion on the future of visual analytics is dedicated to Jim and his work. Jim will be greatly missed but his influence and passion will always be felt.",
  "venue": "IEEE VAST",
  "year": 2010,
  "referenceCount": 0,
  "openAccessPdf": null,
  "fieldsOfStudy": [
    "Computer Science"
  ],
  "s2FieldsOfStudy": [
    {
      "category": "Computer Science",
      "source": "external"
    },
    {
      "category": "Computer Science",
      "source": "s2-fos-model"
    },
    {
      "category": "Political Science",
      "source": "s2-fos-model"
    }
  ],
  "publicationTypes": [
    "JournalArticle",
    "Review"
  ],
  "publicationDate": "2010-12-10",
  "journal": {
    "pages": "257-259"
  },
  "citationStyles": {
    "bibtex": "@Article{May2010TheSO,\n author = {Richard May and P. Hanrahan and D. Keim and B. Shneiderman and S. Card},\n booktitle = {IEEE VAST},\n pages = {257-259},\n title = {The state of visual analytics: Views on what visual analytics is and where it is going},\n year = {2010}\n}\n"
  },
  "authors": [
    {
      "authorId": "144959029",
      "name": "Richard May"
    },
    {
      "authorId": "144872229",
      "name": "P. Hanrahan"
    },
    {
      "authorId": "9106757",
      "name": "D. Keim"
    },
    {
      "authorId": "1740403",
      "name": "B. Shneiderman"
    },
    {
      "authorId": "1720492",
      "name": "S. Card"
    }
  ],
  "references": []
}